#ifndef __ARRAY35_H
#define __ARRAY35_H	


//¾ÉÍ¼Æ¬£¬Ë¢µ½°×
#if 0
#define FRAME_BEGIN_LEN_35		18
unsigned char wave_begin_35[4][FRAME_BEGIN_LEN_35]=
{
0,0,0,0,0,2,2,2,2,1,1,1,1,2,2,2,2,0,						//GC0->GC3
0,0,0,1,1,2,2,2,2,1,1,1,1,2,2,2,2,0,						//GC1->GC3
0,0,1,1,1,2,2,2,2,1,1,1,1,2,2,2,2,0,						//GC2->GC3
0,1,1,1,1,2,2,2,2,1,1,1,1,2,2,2,2,0,						//GC3->GC3
};
#else
#define FRAME_BEGIN_LEN_35		18
unsigned char wave_begin_35[4][FRAME_BEGIN_LEN_35]=
{
0,0,0,0,0,0,0,0,0,2,2,2,2,2,2,2,2,0,						//GC0->GC3
0,0,0,0,1,1,1,1,1,2,2,2,2,2,2,2,2,0,						//GC1->GC3
0,0,1,1,1,1,1,1,1,2,2,2,2,2,2,2,2,0,						//GC2->GC3
0,1,1,1,1,1,1,1,1,2,2,2,2,2,2,2,2,0,						//GC3->GC3
};
#endif

//´Ó°×Ë¢µ½ÐÂÍ¼Æ¬
#define FRAME_END_LEN_35		26
unsigned char wave_end_35[4][FRAME_END_LEN_35]=
{
0,1,1,1,1,1,1,1,1,2,2,2,2,2,2,2,2,1,1,1,1,1,1,1,1,0,				//GC3->GC0
0,1,1,1,1,1,1,1,1,2,2,2,2,2,2,2,2,1,1,1,0,0,0,0,0,0,				//GC3->GC1
0,1,1,1,1,1,1,1,1,2,2,2,2,2,2,2,2,1,0,0,0,0,0,0,0,0,				//GC3->GC2
0,1,1,1,1,1,1,1,1,2,2,2,2,2,2,2,2,0,0,0,0,0,0,0,0,0,				//GC3->GC3
};

#if 1
//ºÚ°×ºÚ°×Ë¢ÆÁ¡£×îÖÕµ½´ï°×±³¾°
#define FRAME_INIT_LEN_35 		2
unsigned long wave_init_35[FRAME_INIT_LEN_35]=
{
//0x55,0x55,0x55,0x55,
//0xaa,0xaa,0xaa,0xaa,
//0x55,0x55,0x55,0x55,
//0,
//0xaa,0xaa,0xaa,0xaa,
//0x55,0x55,0x55,0x55,
//0xaa,0xaa,0xaa,0xaa,
0,0,
};

#endif







#endif



